УТ_для_edt/src/Catalogs/CRM_УсловияОбработкиОбращений/CRM_УсловияОбработкиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УсловияОбработкиОбращений</name>
  <predefined>
    <items>
      <name>БезУсловия</name>
      <description>Без условия</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидУсловия</name>
    <type>
      <types>EnumRef.CRM_ВидыУсловийОбработкиОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.CRM_МеткиКлассификации</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Enums/CRM_ВидыУсловийОбработкиОбращений/CRM_ВидыУсловийОбработкиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыУсловийОбработкиОбращений</name>
  <enumValues>
    <name>СписокСлов</name>
  </enumValues>
  <enumValues>
    <name>МеткаПомощника</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_УсловияОбработкиОбращений/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если Объект.Предопределенный Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Изменение элемента невозможно.'"),,,, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИспользуетсяПомощникКлассификации = CRM_МоделиМашинногоОбучения.КлассификацияОбращенийИспользуется();
	Если Не ИспользуетсяПомощникКлассификации Тогда
		Элементы.ВидУсловия.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ВидУсловия = Перечисления.CRM_ВидыУсловийОбработкиОбращений.СписокСлов Тогда
		Элементы.СтраницыВидыУсловий.ТекущаяСтраница = Элементы.СтраницаСписокСлов;
	ИначеЕсли Объект.ВидУсловия = Перечисления.CRM_ВидыУсловийОбработкиОбращений.МеткаПомощника Тогда
		Элементы.СтраницыВидыУсловий.ТекущаяСтраница = Элементы.СтраницаМеткаПомощника;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидУсловияПриИзменении(Элемент)
	
	Если Объект.ВидУсловия = ПредопределенноеЗначение("Перечисление.CRM_ВидыУсловийОбработкиОбращений.СписокСлов") Тогда
		Элементы.СтраницыВидыУсловий.ТекущаяСтраница = Элементы.СтраницаСписокСлов;
	ИначеЕсли Объект.ВидУсловия = ПредопределенноеЗначение("Перечисление.CRM_ВидыУсловийОбработкиОбращений.МеткаПомощника") Тогда
		Элементы.СтраницыВидыУсловий.ТекущаяСтраница = Элементы.СтраницаМеткаПомощника;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУсловияОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти
